biobotus/module-gripper-psoc/module-gripper-psoc.cydsn/Generated_Source/PSoC5/UART2DYNAMIXEL.c
/*******************************************************************************
* File Name: UART2DYNAMIXEL.c
* Version 2.50
*
* Description:
*  This file provides all API functionality of the UART component
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "UART2DYNAMIXEL.h"
#if (UART2DYNAMIXEL_INTERNAL_CLOCK_USED)
    #include "UART2DYNAMIXEL_IntClock.h"
#endif /* End UART2DYNAMIXEL_INTERNAL_CLOCK_USED */


/***************************************
* Global data allocation
***************************************/

uint8 UART2DYNAMIXEL_initVar = 0u;

#if (UART2DYNAMIXEL_TX_INTERRUPT_ENABLED && UART2DYNAMIXEL_TX_ENABLED)
    volatile uint8 UART2DYNAMIXEL_txBuffer[UART2DYNAMIXEL_TX_BUFFER_SIZE];
    volatile uint8 UART2DYNAMIXEL_txBufferRead = 0u;
    uint8 UART2DYNAMIXEL_txBufferWrite = 0u;
#endif /* (UART2DYNAMIXEL_TX_INTERRUPT_ENABLED && UART2DYNAMIXEL_TX_ENABLED) */

#if (UART2DYNAMIXEL_RX_INTERRUPT_ENABLED && (UART2DYNAMIXEL_RX_ENABLED || UART2DYNAMIXEL_HD_ENABLED))
    uint8 UART2DYNAMIXEL_errorStatus = 0u;
    volatile uint8 UART2DYNAMIXEL_rxBuffer[UART2DYNAMIXEL_RX_BUFFER_SIZE];
    volatile uint8 UART2DYNAMIXEL_rxBufferRead  = 0u;
    volatile uint8 UART2DYNAMIXEL_rxBufferWrite = 0u;
    volatile uint8 UART2DYNAMIXEL_rxBufferLoopDetect = 0u;
    volatile uint8 UART2DYNAMIXEL_rxBufferOverflow   = 0u;
    #if (UART2DYNAMIXEL_RXHW_ADDRESS_ENABLED)
        volatile uint8 UART2DYNAMIXEL_rxAddressMode = UART2DYNAMIXEL_RX_ADDRESS_MODE;
        volatile uint8 UART2DYNAMIXEL_rxAddressDetected = 0u;
    #endif /* (UART2DYNAMIXEL_RXHW_ADDRESS_ENABLED) */
#endif /* (UART2DYNAMIXEL_RX_INTERRUPT_ENABLED && (UART2DYNAMIXEL_RX_ENABLED || UART2DYNAMIXEL_HD_ENABLED)) */


/*******************************************************************************
* Function Name: UART2DYNAMIXEL_Start
********************************************************************************
*
* Summary:
*  This is the preferred method to begin component operation.
*  UART2DYNAMIXEL_Start() sets the initVar variable, calls the
*  UART2DYNAMIXEL_Init() function, and then calls the
*  UART2DYNAMIXEL_Enable() function.
*
* Parameters:
*  None.
*
* Return:
*  None.
*
* Global variables:
*  The UART2DYNAMIXEL_intiVar variable is used to indicate initial
*  configuration of this component. The variable is initialized to zero (0u)
*  and set to one (1u) the first time UART2DYNAMIXEL_Start() is called. This
*  allows for component initialization without re-initialization in all
*  subsequent calls to the UART2DYNAMIXEL_Start() routine.
*
* Reentrant:
*  No.
*
*******************************************************************************/
void UART2DYNAMIXEL_Start(void) 
{
    /* If not initialized then initialize all required hardware and software */
    if(UART2DYNAMIXEL_initVar == 0u)
    {
        UART2DYNAMIXEL_Init();
        UART2DYNAMIXEL_initVar = 1u;
    }

    UART2DYNAMIXEL_Enable();
}


/*******************************************************************************
* Function Name: UART2DYNAMIXEL_Init
********************************************************************************
*
* Summary:
*  Initializes or restores the component according to the customizer Configure
*  dialog settings. It is not necessary to call UART2DYNAMIXEL_Init() because
*  the UART2DYNAMIXEL_Start() API calls this function and is the preferred
*  method to begin component operation.
*
* Parameters:
*  None.
*
* Return:
*  None.
*
*******************************************************************************/
void UART2DYNAMIXEL_Init(void) 
{
    #if(UART2DYNAMIXEL_RX_ENABLED || UART2DYNAMIXEL_HD_ENABLED)

        #if (UART2DYNAMIXEL_RX_INTERRUPT_ENABLED)
            /* Set RX interrupt vector and priority */
            (void) CyIntSetVector(UART2DYNAMIXEL_RX_VECT_NUM, &UART2DYNAMIXEL_RXISR);
            CyIntSetPriority(UART2DYNAMIXEL_RX_VECT_NUM, UART2DYNAMIXEL_RX_PRIOR_NUM);
            UART2DYNAMIXEL_errorStatus = 0u;
        #endif /* (UART2DYNAMIXEL_RX_INTERRUPT_ENABLED) */

        #if (UART2DYNAMIXEL_RXHW_ADDRESS_ENABLED)
            UART2DYNAMIXEL_SetRxAddressMode(UART2DYNAMIXEL_RX_ADDRESS_MODE);
            UART2DYNAMIXEL_SetRxAddress1(UART2DYNAMIXEL_RX_HW_ADDRESS1);
            UART2DYNAMIXEL_SetRxAddress2(UART2DYNAMIXEL_RX_HW_ADDRESS2);
        #endif /* End UART2DYNAMIXEL_RXHW_ADDRESS_ENABLED */

        /* Init Count7 period */
        UART2DYNAMIXEL_RXBITCTR_PERIOD_REG = UART2DYNAMIXEL_RXBITCTR_INIT;
        /* Configure the Initial RX interrupt mask */
        UART2DYNAMIXEL_RXSTATUS_MASK_REG  = UART2DYNAMIXEL_INIT_RX_INTERRUPTS_MASK;
    #endif /* End UART2DYNAMIXEL_RX_ENABLED || UART2DYNAMIXEL_HD_ENABLED*/

    #if(UART2DYNAMIXEL_TX_ENABLED)
        #if (UART2DYNAMIXEL_TX_INTERRUPT_ENABLED)
            /* Set TX interrupt vector and priority */
            (void) CyIntSetVector(UART2DYNAMIXEL_TX_VECT_NUM, &UART2DYNAMIXEL_TXISR);
            CyIntSetPriority(UART2DYNAMIXEL_TX_VECT_NUM, UART2DYNAMIXEL_TX_PRIOR_NUM);
        #endif /* (UART2DYNAMIXEL_TX_INTERRUPT_ENABLED) */

        /* Write Counter Value for TX Bit Clk Generator*/
        #if (UART2DYNAMIXEL_TXCLKGEN_DP)
            UART2DYNAMIXEL_TXBITCLKGEN_CTR_REG = UART2DYNAMIXEL_BIT_CENTER;
            UART2DYNAMIXEL_TXBITCLKTX_COMPLETE_REG = ((UART2DYNAMIXEL_NUMBER_OF_DATA_BITS +
                        UART2DYNAMIXEL_NUMBER_OF_START_BIT) * UART2DYNAMIXEL_OVER_SAMPLE_COUNT) - 1u;
        #else
            UART2DYNAMIXEL_TXBITCTR_PERIOD_REG = ((UART2DYNAMIXEL_NUMBER_OF_DATA_BITS +
                        UART2DYNAMIXEL_NUMBER_OF_START_BIT) * UART2DYNAMIXEL_OVER_SAMPLE_8) - 1u;
        #endif /* End UART2DYNAMIXEL_TXCLKGEN_DP */

        /* Configure the Initial TX interrupt mask */
        #if (UART2DYNAMIXEL_TX_INTERRUPT_ENABLED)
            UART2DYNAMIXEL_TXSTATUS_MASK_REG = UART2DYNAMIXEL_TX_STS_FIFO_EMPTY;
        #else
            UART2DYNAMIXEL_TXSTATUS_MASK_REG = UART2DYNAMIXEL_INIT_TX_INTERRUPTS_MASK;
        #endif /*End UART2DYNAMIXEL_TX_INTERRUPT_ENABLED*/

    #endif /* End UART2DYNAMIXEL_TX_ENABLED */

