biobotus/module-gripper-psoc/module-gripper-psoc.cydsn/Generated_Source/PSoC5/UART2DYNAMIXEL.c
    #if(UART2DYNAMIXEL_PARITY_TYPE_SW)  /* Write Parity to Control Register */
        UART2DYNAMIXEL_WriteControlRegister( \
            (UART2DYNAMIXEL_ReadControlRegister() & (uint8)~UART2DYNAMIXEL_CTRL_PARITY_TYPE_MASK) | \
            (uint8)(UART2DYNAMIXEL_PARITY_TYPE << UART2DYNAMIXEL_CTRL_PARITY_TYPE0_SHIFT) );
    #endif /* End UART2DYNAMIXEL_PARITY_TYPE_SW */
}


/*******************************************************************************
* Function Name: UART2DYNAMIXEL_Enable
********************************************************************************
*
* Summary:
*  Activates the hardware and begins component operation. It is not necessary
*  to call UART2DYNAMIXEL_Enable() because the UART2DYNAMIXEL_Start() API
*  calls this function, which is the preferred method to begin component
*  operation.

* Parameters:
*  None.
*
* Return:
*  None.
*
* Global Variables:
*  UART2DYNAMIXEL_rxAddressDetected - set to initial state (0).
*
*******************************************************************************/
void UART2DYNAMIXEL_Enable(void) 
{
    uint8 enableInterrupts;
    enableInterrupts = CyEnterCriticalSection();

    #if (UART2DYNAMIXEL_RX_ENABLED || UART2DYNAMIXEL_HD_ENABLED)
        /* RX Counter (Count7) Enable */
        UART2DYNAMIXEL_RXBITCTR_CONTROL_REG |= UART2DYNAMIXEL_CNTR_ENABLE;

        /* Enable the RX Interrupt */
        UART2DYNAMIXEL_RXSTATUS_ACTL_REG  |= UART2DYNAMIXEL_INT_ENABLE;

        #if (UART2DYNAMIXEL_RX_INTERRUPT_ENABLED)
            UART2DYNAMIXEL_EnableRxInt();

            #if (UART2DYNAMIXEL_RXHW_ADDRESS_ENABLED)
                UART2DYNAMIXEL_rxAddressDetected = 0u;
            #endif /* (UART2DYNAMIXEL_RXHW_ADDRESS_ENABLED) */
        #endif /* (UART2DYNAMIXEL_RX_INTERRUPT_ENABLED) */
    #endif /* (UART2DYNAMIXEL_RX_ENABLED || UART2DYNAMIXEL_HD_ENABLED) */

    #if(UART2DYNAMIXEL_TX_ENABLED)
        /* TX Counter (DP/Count7) Enable */
        #if(!UART2DYNAMIXEL_TXCLKGEN_DP)
            UART2DYNAMIXEL_TXBITCTR_CONTROL_REG |= UART2DYNAMIXEL_CNTR_ENABLE;
        #endif /* End UART2DYNAMIXEL_TXCLKGEN_DP */

        /* Enable the TX Interrupt */
        UART2DYNAMIXEL_TXSTATUS_ACTL_REG |= UART2DYNAMIXEL_INT_ENABLE;
        #if (UART2DYNAMIXEL_TX_INTERRUPT_ENABLED)
            UART2DYNAMIXEL_ClearPendingTxInt(); /* Clear history of TX_NOT_EMPTY */
            UART2DYNAMIXEL_EnableTxInt();
        #endif /* (UART2DYNAMIXEL_TX_INTERRUPT_ENABLED) */
     #endif /* (UART2DYNAMIXEL_TX_INTERRUPT_ENABLED) */

    #if (UART2DYNAMIXEL_INTERNAL_CLOCK_USED)
        UART2DYNAMIXEL_IntClock_Start();  /* Enable the clock */
    #endif /* (UART2DYNAMIXEL_INTERNAL_CLOCK_USED) */

    CyExitCriticalSection(enableInterrupts);
}


/*******************************************************************************
* Function Name: UART2DYNAMIXEL_Stop
********************************************************************************
*
* Summary:
*  Disables the UART operation.
*
* Parameters:
*  None.
*
* Return:
*  None.
*
*******************************************************************************/
void UART2DYNAMIXEL_Stop(void) 
{
    uint8 enableInterrupts;
    enableInterrupts = CyEnterCriticalSection();

    /* Write Bit Counter Disable */
    #if (UART2DYNAMIXEL_RX_ENABLED || UART2DYNAMIXEL_HD_ENABLED)
        UART2DYNAMIXEL_RXBITCTR_CONTROL_REG &= (uint8) ~UART2DYNAMIXEL_CNTR_ENABLE;
    #endif /* (UART2DYNAMIXEL_RX_ENABLED || UART2DYNAMIXEL_HD_ENABLED) */

    #if (UART2DYNAMIXEL_TX_ENABLED)
        #if(!UART2DYNAMIXEL_TXCLKGEN_DP)
            UART2DYNAMIXEL_TXBITCTR_CONTROL_REG &= (uint8) ~UART2DYNAMIXEL_CNTR_ENABLE;
        #endif /* (!UART2DYNAMIXEL_TXCLKGEN_DP) */
    #endif /* (UART2DYNAMIXEL_TX_ENABLED) */

    #if (UART2DYNAMIXEL_INTERNAL_CLOCK_USED)
        UART2DYNAMIXEL_IntClock_Stop();   /* Disable the clock */
    #endif /* (UART2DYNAMIXEL_INTERNAL_CLOCK_USED) */

    /* Disable internal interrupt component */
    #if (UART2DYNAMIXEL_RX_ENABLED || UART2DYNAMIXEL_HD_ENABLED)
        UART2DYNAMIXEL_RXSTATUS_ACTL_REG  &= (uint8) ~UART2DYNAMIXEL_INT_ENABLE;

        #if (UART2DYNAMIXEL_RX_INTERRUPT_ENABLED)
            UART2DYNAMIXEL_DisableRxInt();
        #endif /* (UART2DYNAMIXEL_RX_INTERRUPT_ENABLED) */
    #endif /* (UART2DYNAMIXEL_RX_ENABLED || UART2DYNAMIXEL_HD_ENABLED) */

    #if (UART2DYNAMIXEL_TX_ENABLED)
        UART2DYNAMIXEL_TXSTATUS_ACTL_REG &= (uint8) ~UART2DYNAMIXEL_INT_ENABLE;

        #if (UART2DYNAMIXEL_TX_INTERRUPT_ENABLED)
            UART2DYNAMIXEL_DisableTxInt();
        #endif /* (UART2DYNAMIXEL_TX_INTERRUPT_ENABLED) */
    #endif /* (UART2DYNAMIXEL_TX_ENABLED) */

    CyExitCriticalSection(enableInterrupts);
}


/*******************************************************************************
* Function Name: UART2DYNAMIXEL_ReadControlRegister
********************************************************************************
*
* Summary:
*  Returns the current value of the control register.
*
* Parameters:
*  None.
*
* Return:
*  Contents of the control register.
*
*******************************************************************************/
uint8 UART2DYNAMIXEL_ReadControlRegister(void) 
{
    #if (UART2DYNAMIXEL_CONTROL_REG_REMOVED)
        return(0u);
    #else
        return(UART2DYNAMIXEL_CONTROL_REG);
    #endif /* (UART2DYNAMIXEL_CONTROL_REG_REMOVED) */
}


/*******************************************************************************
* Function Name: UART2DYNAMIXEL_WriteControlRegister
********************************************************************************
*
* Summary:
*  Writes an 8-bit value into the control register
*
* Parameters:
*  control:  control register value
*
* Return:
*  None.
*
*******************************************************************************/
void  UART2DYNAMIXEL_WriteControlRegister(uint8 control) 
{
    #if (UART2DYNAMIXEL_CONTROL_REG_REMOVED)
        if(0u != control)
        {
            /* Suppress compiler warning */
        }
    #else
       UART2DYNAMIXEL_CONTROL_REG = control;
    #endif /* (UART2DYNAMIXEL_CONTROL_REG_REMOVED) */
}


#if(UART2DYNAMIXEL_RX_ENABLED || UART2DYNAMIXEL_HD_ENABLED)
    /*******************************************************************************
    * Function Name: UART2DYNAMIXEL_SetRxInterruptMode
    ********************************************************************************
    *
    * Summary:
    *  Configures the RX interrupt sources enabled.
    *
    * Parameters:
    *  IntSrc:  Bit field containing the RX interrupts to enable. Based on the 
    *  bit-field arrangement of the status register. This value must be a 
    *  combination of status register bit-masks shown below:
    *      UART2DYNAMIXEL_RX_STS_FIFO_NOTEMPTY    Interrupt on byte received.
    *      UART2DYNAMIXEL_RX_STS_PAR_ERROR        Interrupt on parity error.
    *      UART2DYNAMIXEL_RX_STS_STOP_ERROR       Interrupt on stop error.
    *      UART2DYNAMIXEL_RX_STS_BREAK            Interrupt on break.
    *      UART2DYNAMIXEL_RX_STS_OVERRUN          Interrupt on overrun error.
    *      UART2DYNAMIXEL_RX_STS_ADDR_MATCH       Interrupt on address match.
    *      UART2DYNAMIXEL_RX_STS_MRKSPC           Interrupt on address detect.
    *
    * Return:
    *  None.
    *
    * Theory:
    *  Enables the output of specific status bits to the interrupt controller
    *
    *******************************************************************************/
    void UART2DYNAMIXEL_SetRxInterruptMode(uint8 intSrc) 
    {
        UART2DYNAMIXEL_RXSTATUS_MASK_REG  = intSrc;
    }


