biobotus/module-gripper-psoc/module-gripper-psoc.cydsn/Generated_Source/PSoC5/UART2DYNAMIXEL.c
    /*******************************************************************************
    * Function Name: UART2DYNAMIXEL_ReadRxData
    ********************************************************************************
    *
    * Summary:
    *  Returns the next byte of received data. This function returns data without
    *  checking the status. You must check the status separately.
    *
    * Parameters:
    *  None.
    *
    * Return:
    *  Received data from RX register
    *
    * Global Variables:
    *  UART2DYNAMIXEL_rxBuffer - RAM buffer pointer for save received data.
    *  UART2DYNAMIXEL_rxBufferWrite - cyclic index for write to rxBuffer,
    *     checked to identify new data.
    *  UART2DYNAMIXEL_rxBufferRead - cyclic index for read from rxBuffer,
    *     incremented after each byte has been read from buffer.
    *  UART2DYNAMIXEL_rxBufferLoopDetect - cleared if loop condition was detected
    *     in RX ISR.
    *
    * Reentrant:
    *  No.
    *
    *******************************************************************************/
    uint8 UART2DYNAMIXEL_ReadRxData(void) 
    {
        uint8 rxData;

    #if (UART2DYNAMIXEL_RX_INTERRUPT_ENABLED)

        uint8 locRxBufferRead;
        uint8 locRxBufferWrite;

        /* Protect variables that could change on interrupt */
        UART2DYNAMIXEL_DisableRxInt();

        locRxBufferRead  = UART2DYNAMIXEL_rxBufferRead;
        locRxBufferWrite = UART2DYNAMIXEL_rxBufferWrite;

        if( (UART2DYNAMIXEL_rxBufferLoopDetect != 0u) || (locRxBufferRead != locRxBufferWrite) )
        {
            rxData = UART2DYNAMIXEL_rxBuffer[locRxBufferRead];
            locRxBufferRead++;

            if(locRxBufferRead >= UART2DYNAMIXEL_RX_BUFFER_SIZE)
            {
                locRxBufferRead = 0u;
            }
            /* Update the real pointer */
            UART2DYNAMIXEL_rxBufferRead = locRxBufferRead;

            if(UART2DYNAMIXEL_rxBufferLoopDetect != 0u)
            {
                UART2DYNAMIXEL_rxBufferLoopDetect = 0u;
                #if ((UART2DYNAMIXEL_RX_INTERRUPT_ENABLED) && (UART2DYNAMIXEL_FLOW_CONTROL != 0u))
                    /* When Hardware Flow Control selected - return RX mask */
                    #if( UART2DYNAMIXEL_HD_ENABLED )
                        if((UART2DYNAMIXEL_CONTROL_REG & UART2DYNAMIXEL_CTRL_HD_SEND) == 0u)
                        {   /* In Half duplex mode return RX mask only in RX
                            *  configuration set, otherwise
                            *  mask will be returned in LoadRxConfig() API.
                            */
                            UART2DYNAMIXEL_RXSTATUS_MASK_REG  |= UART2DYNAMIXEL_RX_STS_FIFO_NOTEMPTY;
                        }
                    #else
                        UART2DYNAMIXEL_RXSTATUS_MASK_REG  |= UART2DYNAMIXEL_RX_STS_FIFO_NOTEMPTY;
                    #endif /* end UART2DYNAMIXEL_HD_ENABLED */
                #endif /* ((UART2DYNAMIXEL_RX_INTERRUPT_ENABLED) && (UART2DYNAMIXEL_FLOW_CONTROL != 0u)) */
            }
        }
        else
        {   /* Needs to check status for RX_STS_FIFO_NOTEMPTY bit */
            rxData = UART2DYNAMIXEL_RXDATA_REG;
        }

        UART2DYNAMIXEL_EnableRxInt();

    #else

        /* Needs to check status for RX_STS_FIFO_NOTEMPTY bit */
        rxData = UART2DYNAMIXEL_RXDATA_REG;

    #endif /* (UART2DYNAMIXEL_RX_INTERRUPT_ENABLED) */

        return(rxData);
    }


    /*******************************************************************************
    * Function Name: UART2DYNAMIXEL_ReadRxStatus
    ********************************************************************************
    *
    * Summary:
    *  Returns the current state of the receiver status register and the software
    *  buffer overflow status.
    *
    * Parameters:
    *  None.
    *
    * Return:
    *  Current state of the status register.
    *
    * Side Effect:
    *  All status register bits are clear-on-read except
    *  UART2DYNAMIXEL_RX_STS_FIFO_NOTEMPTY.
    *  UART2DYNAMIXEL_RX_STS_FIFO_NOTEMPTY clears immediately after RX data
    *  register read.
    *
    * Global Variables:
    *  UART2DYNAMIXEL_rxBufferOverflow - used to indicate overload condition.
    *   It set to one in RX interrupt when there isn't free space in
    *   UART2DYNAMIXEL_rxBufferRead to write new data. This condition returned
    *   and cleared to zero by this API as an
    *   UART2DYNAMIXEL_RX_STS_SOFT_BUFF_OVER bit along with RX Status register
    *   bits.
    *
    *******************************************************************************/
    uint8 UART2DYNAMIXEL_ReadRxStatus(void) 
    {
        uint8 status;

        status = UART2DYNAMIXEL_RXSTATUS_REG & UART2DYNAMIXEL_RX_HW_MASK;

    #if (UART2DYNAMIXEL_RX_INTERRUPT_ENABLED)
        if(UART2DYNAMIXEL_rxBufferOverflow != 0u)
        {
            status |= UART2DYNAMIXEL_RX_STS_SOFT_BUFF_OVER;
            UART2DYNAMIXEL_rxBufferOverflow = 0u;
        }
    #endif /* (UART2DYNAMIXEL_RX_INTERRUPT_ENABLED) */

        return(status);
    }


    /*******************************************************************************
    * Function Name: UART2DYNAMIXEL_GetChar
    ********************************************************************************
    *
    * Summary:
    *  Returns the last received byte of data. UART2DYNAMIXEL_GetChar() is
    *  designed for ASCII characters and returns a uint8 where 1 to 255 are values
    *  for valid characters and 0 indicates an error occurred or no data is present.
    *
    * Parameters:
    *  None.
    *
    * Return:
    *  Character read from UART RX buffer. ASCII characters from 1 to 255 are valid.
    *  A returned zero signifies an error condition or no data available.
    *
    * Global Variables:
    *  UART2DYNAMIXEL_rxBuffer - RAM buffer pointer for save received data.
    *  UART2DYNAMIXEL_rxBufferWrite - cyclic index for write to rxBuffer,
    *     checked to identify new data.
    *  UART2DYNAMIXEL_rxBufferRead - cyclic index for read from rxBuffer,
    *     incremented after each byte has been read from buffer.
    *  UART2DYNAMIXEL_rxBufferLoopDetect - cleared if loop condition was detected
    *     in RX ISR.
    *
    * Reentrant:
    *  No.
    *
    *******************************************************************************/
    uint8 UART2DYNAMIXEL_GetChar(void) 
    {
        uint8 rxData = 0u;
        uint8 rxStatus;

    #if (UART2DYNAMIXEL_RX_INTERRUPT_ENABLED)
        uint8 locRxBufferRead;
        uint8 locRxBufferWrite;

