biobotus/module-gripper-psoc/module-gripper-psoc.cydsn/Generated_Source/PSoC5/UART2DYNAMIXEL.c
        /* Protect variables that could change on interrupt */
        UART2DYNAMIXEL_DisableRxInt();

        locRxBufferRead  = UART2DYNAMIXEL_rxBufferRead;
        locRxBufferWrite = UART2DYNAMIXEL_rxBufferWrite;

        if( (UART2DYNAMIXEL_rxBufferLoopDetect != 0u) || (locRxBufferRead != locRxBufferWrite) )
        {
            rxData = UART2DYNAMIXEL_rxBuffer[locRxBufferRead];
            locRxBufferRead++;
            if(locRxBufferRead >= UART2DYNAMIXEL_RX_BUFFER_SIZE)
            {
                locRxBufferRead = 0u;
            }
            /* Update the real pointer */
            UART2DYNAMIXEL_rxBufferRead = locRxBufferRead;

            if(UART2DYNAMIXEL_rxBufferLoopDetect != 0u)
            {
                UART2DYNAMIXEL_rxBufferLoopDetect = 0u;
                #if( (UART2DYNAMIXEL_RX_INTERRUPT_ENABLED) && (UART2DYNAMIXEL_FLOW_CONTROL != 0u) )
                    /* When Hardware Flow Control selected - return RX mask */
                    #if( UART2DYNAMIXEL_HD_ENABLED )
                        if((UART2DYNAMIXEL_CONTROL_REG & UART2DYNAMIXEL_CTRL_HD_SEND) == 0u)
                        {   /* In Half duplex mode return RX mask only if
                            *  RX configuration set, otherwise
                            *  mask will be returned in LoadRxConfig() API.
                            */
                            UART2DYNAMIXEL_RXSTATUS_MASK_REG |= UART2DYNAMIXEL_RX_STS_FIFO_NOTEMPTY;
                        }
                    #else
                        UART2DYNAMIXEL_RXSTATUS_MASK_REG |= UART2DYNAMIXEL_RX_STS_FIFO_NOTEMPTY;
                    #endif /* end UART2DYNAMIXEL_HD_ENABLED */
                #endif /* UART2DYNAMIXEL_RX_INTERRUPT_ENABLED and Hardware flow control*/
            }

        }
        else
        {   rxStatus = UART2DYNAMIXEL_RXSTATUS_REG;
            if((rxStatus & UART2DYNAMIXEL_RX_STS_FIFO_NOTEMPTY) != 0u)
            {   /* Read received data from FIFO */
                rxData = UART2DYNAMIXEL_RXDATA_REG;
                /*Check status on error*/
                if((rxStatus & (UART2DYNAMIXEL_RX_STS_BREAK | UART2DYNAMIXEL_RX_STS_PAR_ERROR |
                                UART2DYNAMIXEL_RX_STS_STOP_ERROR | UART2DYNAMIXEL_RX_STS_OVERRUN)) != 0u)
                {
                    rxData = 0u;
                }
            }
        }

        UART2DYNAMIXEL_EnableRxInt();

    #else

        rxStatus =UART2DYNAMIXEL_RXSTATUS_REG;
        if((rxStatus & UART2DYNAMIXEL_RX_STS_FIFO_NOTEMPTY) != 0u)
        {
            /* Read received data from FIFO */
            rxData = UART2DYNAMIXEL_RXDATA_REG;

            /*Check status on error*/
            if((rxStatus & (UART2DYNAMIXEL_RX_STS_BREAK | UART2DYNAMIXEL_RX_STS_PAR_ERROR |
                            UART2DYNAMIXEL_RX_STS_STOP_ERROR | UART2DYNAMIXEL_RX_STS_OVERRUN)) != 0u)
            {
                rxData = 0u;
            }
        }
    #endif /* (UART2DYNAMIXEL_RX_INTERRUPT_ENABLED) */

        return(rxData);
    }


    /*******************************************************************************
    * Function Name: UART2DYNAMIXEL_GetByte
    ********************************************************************************
    *
    * Summary:
    *  Reads UART RX buffer immediately, returns received character and error
    *  condition.
    *
    * Parameters:
    *  None.
    *
    * Return:
    *  MSB contains status and LSB contains UART RX data. If the MSB is nonzero,
    *  an error has occurred.
    *
    * Reentrant:
    *  No.
    *
    *******************************************************************************/
    uint16 UART2DYNAMIXEL_GetByte(void) 
    {
        
    #if (UART2DYNAMIXEL_RX_INTERRUPT_ENABLED)
        uint16 locErrorStatus;
        /* Protect variables that could change on interrupt */
        UART2DYNAMIXEL_DisableRxInt();
        locErrorStatus = (uint16)UART2DYNAMIXEL_errorStatus;
        UART2DYNAMIXEL_errorStatus = 0u;
        UART2DYNAMIXEL_EnableRxInt();
        return ( (uint16)(locErrorStatus << 8u) | UART2DYNAMIXEL_ReadRxData() );
    #else
        return ( ((uint16)UART2DYNAMIXEL_ReadRxStatus() << 8u) | UART2DYNAMIXEL_ReadRxData() );
    #endif /* UART2DYNAMIXEL_RX_INTERRUPT_ENABLED */
        
    }


    /*******************************************************************************
    * Function Name: UART2DYNAMIXEL_GetRxBufferSize
    ********************************************************************************
    *
    * Summary:
    *  Returns the number of received bytes available in the RX buffer.
    *  * RX software buffer is disabled (RX Buffer Size parameter is equal to 4): 
    *    returns 0 for empty RX FIFO or 1 for not empty RX FIFO.
    *  * RX software buffer is enabled: returns the number of bytes available in 
    *    the RX software buffer. Bytes available in the RX FIFO do not take to 
    *    account.
    *
    * Parameters:
    *  None.
    *
    * Return:
    *  uint8: Number of bytes in the RX buffer. 
    *    Return value type depends on RX Buffer Size parameter.
    *
    * Global Variables:
    *  UART2DYNAMIXEL_rxBufferWrite - used to calculate left bytes.
    *  UART2DYNAMIXEL_rxBufferRead - used to calculate left bytes.
    *  UART2DYNAMIXEL_rxBufferLoopDetect - checked to decide left bytes amount.
    *
    * Reentrant:
    *  No.
    *
    * Theory:
    *  Allows the user to find out how full the RX Buffer is.
    *
    *******************************************************************************/
    uint8 UART2DYNAMIXEL_GetRxBufferSize(void)
                                                            
    {
        uint8 size;

    #if (UART2DYNAMIXEL_RX_INTERRUPT_ENABLED)

        /* Protect variables that could change on interrupt */
        UART2DYNAMIXEL_DisableRxInt();

        if(UART2DYNAMIXEL_rxBufferRead == UART2DYNAMIXEL_rxBufferWrite)
        {
            if(UART2DYNAMIXEL_rxBufferLoopDetect != 0u)
            {
                size = UART2DYNAMIXEL_RX_BUFFER_SIZE;
            }
            else
            {
                size = 0u;
            }
        }
        else if(UART2DYNAMIXEL_rxBufferRead < UART2DYNAMIXEL_rxBufferWrite)
        {
            size = (UART2DYNAMIXEL_rxBufferWrite - UART2DYNAMIXEL_rxBufferRead);
        }
        else
        {
            size = (UART2DYNAMIXEL_RX_BUFFER_SIZE - UART2DYNAMIXEL_rxBufferRead) + UART2DYNAMIXEL_rxBufferWrite;
        }

        UART2DYNAMIXEL_EnableRxInt();

    #else

