biobotus/module-gripper-psoc/module-gripper-psoc.cydsn/Generated_Source/PSoC5/UART2DYNAMIXEL.c
        /* We can only know if there is data in the fifo. */
        size = ((UART2DYNAMIXEL_RXSTATUS_REG & UART2DYNAMIXEL_RX_STS_FIFO_NOTEMPTY) != 0u) ? 1u : 0u;

    #endif /* (UART2DYNAMIXEL_RX_INTERRUPT_ENABLED) */

        return(size);
    }


    /*******************************************************************************
    * Function Name: UART2DYNAMIXEL_ClearRxBuffer
    ********************************************************************************
    *
    * Summary:
    *  Clears the receiver memory buffer and hardware RX FIFO of all received data.
    *
    * Parameters:
    *  None.
    *
    * Return:
    *  None.
    *
    * Global Variables:
    *  UART2DYNAMIXEL_rxBufferWrite - cleared to zero.
    *  UART2DYNAMIXEL_rxBufferRead - cleared to zero.
    *  UART2DYNAMIXEL_rxBufferLoopDetect - cleared to zero.
    *  UART2DYNAMIXEL_rxBufferOverflow - cleared to zero.
    *
    * Reentrant:
    *  No.
    *
    * Theory:
    *  Setting the pointers to zero makes the system believe there is no data to
    *  read and writing will resume at address 0 overwriting any data that may
    *  have remained in the RAM.
    *
    * Side Effects:
    *  Any received data not read from the RAM or FIFO buffer will be lost.
    *
    *******************************************************************************/
    void UART2DYNAMIXEL_ClearRxBuffer(void) 
    {
        uint8 enableInterrupts;

        /* Clear the HW FIFO */
        enableInterrupts = CyEnterCriticalSection();
        UART2DYNAMIXEL_RXDATA_AUX_CTL_REG |= (uint8)  UART2DYNAMIXEL_RX_FIFO_CLR;
        UART2DYNAMIXEL_RXDATA_AUX_CTL_REG &= (uint8) ~UART2DYNAMIXEL_RX_FIFO_CLR;
        CyExitCriticalSection(enableInterrupts);

    #if (UART2DYNAMIXEL_RX_INTERRUPT_ENABLED)

        /* Protect variables that could change on interrupt. */
        UART2DYNAMIXEL_DisableRxInt();

        UART2DYNAMIXEL_rxBufferRead = 0u;
        UART2DYNAMIXEL_rxBufferWrite = 0u;
        UART2DYNAMIXEL_rxBufferLoopDetect = 0u;
        UART2DYNAMIXEL_rxBufferOverflow = 0u;

        UART2DYNAMIXEL_EnableRxInt();

    #endif /* (UART2DYNAMIXEL_RX_INTERRUPT_ENABLED) */

    }


    /*******************************************************************************
    * Function Name: UART2DYNAMIXEL_SetRxAddressMode
    ********************************************************************************
    *
    * Summary:
    *  Sets the software controlled Addressing mode used by the RX portion of the
    *  UART.
    *
    * Parameters:
    *  addressMode: Enumerated value indicating the mode of RX addressing
    *  UART2DYNAMIXEL__B_UART__AM_SW_BYTE_BYTE -  Software Byte-by-Byte address
    *                                               detection
    *  UART2DYNAMIXEL__B_UART__AM_SW_DETECT_TO_BUFFER - Software Detect to Buffer
    *                                               address detection
    *  UART2DYNAMIXEL__B_UART__AM_HW_BYTE_BY_BYTE - Hardware Byte-by-Byte address
    *                                               detection
    *  UART2DYNAMIXEL__B_UART__AM_HW_DETECT_TO_BUFFER - Hardware Detect to Buffer
    *                                               address detection
    *  UART2DYNAMIXEL__B_UART__AM_NONE - No address detection
    *
    * Return:
    *  None.
    *
    * Global Variables:
    *  UART2DYNAMIXEL_rxAddressMode - the parameter stored in this variable for
    *   the farther usage in RX ISR.
    *  UART2DYNAMIXEL_rxAddressDetected - set to initial state (0).
    *
    *******************************************************************************/
    void UART2DYNAMIXEL_SetRxAddressMode(uint8 addressMode)
                                                        
    {
        #if(UART2DYNAMIXEL_RXHW_ADDRESS_ENABLED)
            #if(UART2DYNAMIXEL_CONTROL_REG_REMOVED)
                if(0u != addressMode)
                {
                    /* Suppress compiler warning */
                }
            #else /* UART2DYNAMIXEL_CONTROL_REG_REMOVED */
                uint8 tmpCtrl;
                tmpCtrl = UART2DYNAMIXEL_CONTROL_REG & (uint8)~UART2DYNAMIXEL_CTRL_RXADDR_MODE_MASK;
                tmpCtrl |= (uint8)(addressMode << UART2DYNAMIXEL_CTRL_RXADDR_MODE0_SHIFT);
                UART2DYNAMIXEL_CONTROL_REG = tmpCtrl;

                #if(UART2DYNAMIXEL_RX_INTERRUPT_ENABLED && \
                   (UART2DYNAMIXEL_RXBUFFERSIZE > UART2DYNAMIXEL_FIFO_LENGTH) )
                    UART2DYNAMIXEL_rxAddressMode = addressMode;
                    UART2DYNAMIXEL_rxAddressDetected = 0u;
                #endif /* End UART2DYNAMIXEL_RXBUFFERSIZE > UART2DYNAMIXEL_FIFO_LENGTH*/
            #endif /* End UART2DYNAMIXEL_CONTROL_REG_REMOVED */
        #else /* UART2DYNAMIXEL_RXHW_ADDRESS_ENABLED */
            if(0u != addressMode)
            {
                /* Suppress compiler warning */
            }
        #endif /* End UART2DYNAMIXEL_RXHW_ADDRESS_ENABLED */
    }


    /*******************************************************************************
    * Function Name: UART2DYNAMIXEL_SetRxAddress1
    ********************************************************************************
    *
    * Summary:
    *  Sets the first of two hardware-detectable receiver addresses.
    *
    * Parameters:
    *  address: Address #1 for hardware address detection.
    *
    * Return:
    *  None.
    *
    *******************************************************************************/
    void UART2DYNAMIXEL_SetRxAddress1(uint8 address) 
    {
        UART2DYNAMIXEL_RXADDRESS1_REG = address;
    }


    /*******************************************************************************
    * Function Name: UART2DYNAMIXEL_SetRxAddress2
    ********************************************************************************
    *
    * Summary:
    *  Sets the second of two hardware-detectable receiver addresses.
    *
    * Parameters:
    *  address: Address #2 for hardware address detection.
    *
    * Return:
    *  None.
    *
    *******************************************************************************/
    void UART2DYNAMIXEL_SetRxAddress2(uint8 address) 
    {
        UART2DYNAMIXEL_RXADDRESS2_REG = address;
    }

#endif  /* UART2DYNAMIXEL_RX_ENABLED || UART2DYNAMIXEL_HD_ENABLED*/


#if( (UART2DYNAMIXEL_TX_ENABLED) || (UART2DYNAMIXEL_HD_ENABLED) )
    /*******************************************************************************
    * Function Name: UART2DYNAMIXEL_SetTxInterruptMode
    ********************************************************************************
    *
    * Summary:
    *  Configures the TX interrupt sources to be enabled, but does not enable the
    *  interrupt.
    *
    * Parameters:
    *  intSrc: Bit field containing the TX interrupt sources to enable
    *   UART2DYNAMIXEL_TX_STS_COMPLETE        Interrupt on TX byte complete
    *   UART2DYNAMIXEL_TX_STS_FIFO_EMPTY      Interrupt when TX FIFO is empty
    *   UART2DYNAMIXEL_TX_STS_FIFO_FULL       Interrupt when TX FIFO is full
    *   UART2DYNAMIXEL_TX_STS_FIFO_NOT_FULL   Interrupt when TX FIFO is not full
    *
    * Return:
    *  None.
    *
    * Theory:
    *  Enables the output of specific status bits to the interrupt controller
    *
    *******************************************************************************/
    void UART2DYNAMIXEL_SetTxInterruptMode(uint8 intSrc) 
    {
        UART2DYNAMIXEL_TXSTATUS_MASK_REG = intSrc;
    }


