biobotus/module-gripper-psoc/module-gripper-psoc.cydsn/Generated_Source/PSoC5/UART2DYNAMIXEL.c
    /*******************************************************************************
    * Function Name: UART2DYNAMIXEL_WriteTxData
    ********************************************************************************
    *
    * Summary:
    *  Places a byte of data into the transmit buffer to be sent when the bus is
    *  available without checking the TX status register. You must check status
    *  separately.
    *
    * Parameters:
    *  txDataByte: data byte
    *
    * Return:
    * None.
    *
    * Global Variables:
    *  UART2DYNAMIXEL_txBuffer - RAM buffer pointer for save data for transmission
    *  UART2DYNAMIXEL_txBufferWrite - cyclic index for write to txBuffer,
    *    incremented after each byte saved to buffer.
    *  UART2DYNAMIXEL_txBufferRead - cyclic index for read from txBuffer,
    *    checked to identify the condition to write to FIFO directly or to TX buffer
    *  UART2DYNAMIXEL_initVar - checked to identify that the component has been
    *    initialized.
    *
    * Reentrant:
    *  No.
    *
    *******************************************************************************/
    void UART2DYNAMIXEL_WriteTxData(uint8 txDataByte) 
    {
        /* If not Initialized then skip this function*/
        if(UART2DYNAMIXEL_initVar != 0u)
        {
        #if (UART2DYNAMIXEL_TX_INTERRUPT_ENABLED)

            /* Protect variables that could change on interrupt. */
            UART2DYNAMIXEL_DisableTxInt();

            if( (UART2DYNAMIXEL_txBufferRead == UART2DYNAMIXEL_txBufferWrite) &&
                ((UART2DYNAMIXEL_TXSTATUS_REG & UART2DYNAMIXEL_TX_STS_FIFO_FULL) == 0u) )
            {
                /* Add directly to the FIFO. */
                UART2DYNAMIXEL_TXDATA_REG = txDataByte;
            }
            else
            {
                if(UART2DYNAMIXEL_txBufferWrite >= UART2DYNAMIXEL_TX_BUFFER_SIZE)
                {
                    UART2DYNAMIXEL_txBufferWrite = 0u;
                }

                UART2DYNAMIXEL_txBuffer[UART2DYNAMIXEL_txBufferWrite] = txDataByte;

                /* Add to the software buffer. */
                UART2DYNAMIXEL_txBufferWrite++;
            }

            UART2DYNAMIXEL_EnableTxInt();

        #else

            /* Add directly to the FIFO. */
            UART2DYNAMIXEL_TXDATA_REG = txDataByte;

        #endif /*(UART2DYNAMIXEL_TX_INTERRUPT_ENABLED) */
        }
    }


    /*******************************************************************************
    * Function Name: UART2DYNAMIXEL_ReadTxStatus
    ********************************************************************************
    *
    * Summary:
    *  Reads the status register for the TX portion of the UART.
    *
    * Parameters:
    *  None.
    *
    * Return:
    *  Contents of the status register
    *
    * Theory:
    *  This function reads the TX status register, which is cleared on read.
    *  It is up to the user to handle all bits in this return value accordingly,
    *  even if the bit was not enabled as an interrupt source the event happened
    *  and must be handled accordingly.
    *
    *******************************************************************************/
    uint8 UART2DYNAMIXEL_ReadTxStatus(void) 
    {
        return(UART2DYNAMIXEL_TXSTATUS_REG);
    }


    /*******************************************************************************
    * Function Name: UART2DYNAMIXEL_PutChar
    ********************************************************************************
    *
    * Summary:
    *  Puts a byte of data into the transmit buffer to be sent when the bus is
    *  available. This is a blocking API that waits until the TX buffer has room to
    *  hold the data.
    *
    * Parameters:
    *  txDataByte: Byte containing the data to transmit
    *
    * Return:
    *  None.
    *
    * Global Variables:
    *  UART2DYNAMIXEL_txBuffer - RAM buffer pointer for save data for transmission
    *  UART2DYNAMIXEL_txBufferWrite - cyclic index for write to txBuffer,
    *     checked to identify free space in txBuffer and incremented after each byte
    *     saved to buffer.
    *  UART2DYNAMIXEL_txBufferRead - cyclic index for read from txBuffer,
    *     checked to identify free space in txBuffer.
    *  UART2DYNAMIXEL_initVar - checked to identify that the component has been
    *     initialized.
    *
    * Reentrant:
    *  No.
    *
    * Theory:
    *  Allows the user to transmit any byte of data in a single transfer
    *
    *******************************************************************************/
    void UART2DYNAMIXEL_PutChar(uint8 txDataByte) 
    {
    #if (UART2DYNAMIXEL_TX_INTERRUPT_ENABLED)
        /* The temporary output pointer is used since it takes two instructions
        *  to increment with a wrap, and we can't risk doing that with the real
        *  pointer and getting an interrupt in between instructions.
        */
        uint8 locTxBufferWrite;
        uint8 locTxBufferRead;

        do
        { /* Block if software buffer is full, so we don't overwrite. */

        #if ((UART2DYNAMIXEL_TX_BUFFER_SIZE > UART2DYNAMIXEL_MAX_BYTE_VALUE) && (CY_PSOC3))
            /* Disable TX interrupt to protect variables from modification */
            UART2DYNAMIXEL_DisableTxInt();
        #endif /* (UART2DYNAMIXEL_TX_BUFFER_SIZE > UART2DYNAMIXEL_MAX_BYTE_VALUE) && (CY_PSOC3) */

            locTxBufferWrite = UART2DYNAMIXEL_txBufferWrite;
            locTxBufferRead  = UART2DYNAMIXEL_txBufferRead;

        #if ((UART2DYNAMIXEL_TX_BUFFER_SIZE > UART2DYNAMIXEL_MAX_BYTE_VALUE) && (CY_PSOC3))
            /* Enable interrupt to continue transmission */
            UART2DYNAMIXEL_EnableTxInt();
        #endif /* (UART2DYNAMIXEL_TX_BUFFER_SIZE > UART2DYNAMIXEL_MAX_BYTE_VALUE) && (CY_PSOC3) */
        }
        while( (locTxBufferWrite < locTxBufferRead) ? (locTxBufferWrite == (locTxBufferRead - 1u)) :
                                ((locTxBufferWrite - locTxBufferRead) ==
                                (uint8)(UART2DYNAMIXEL_TX_BUFFER_SIZE - 1u)) );

        if( (locTxBufferRead == locTxBufferWrite) &&
            ((UART2DYNAMIXEL_TXSTATUS_REG & UART2DYNAMIXEL_TX_STS_FIFO_FULL) == 0u) )
        {
            /* Add directly to the FIFO */
            UART2DYNAMIXEL_TXDATA_REG = txDataByte;
        }
        else
        {
            if(locTxBufferWrite >= UART2DYNAMIXEL_TX_BUFFER_SIZE)
            {
                locTxBufferWrite = 0u;
            }
            /* Add to the software buffer. */
            UART2DYNAMIXEL_txBuffer[locTxBufferWrite] = txDataByte;
            locTxBufferWrite++;

            /* Finally, update the real output pointer */
        #if ((UART2DYNAMIXEL_TX_BUFFER_SIZE > UART2DYNAMIXEL_MAX_BYTE_VALUE) && (CY_PSOC3))
            UART2DYNAMIXEL_DisableTxInt();
        #endif /* (UART2DYNAMIXEL_TX_BUFFER_SIZE > UART2DYNAMIXEL_MAX_BYTE_VALUE) && (CY_PSOC3) */

            UART2DYNAMIXEL_txBufferWrite = locTxBufferWrite;

        #if ((UART2DYNAMIXEL_TX_BUFFER_SIZE > UART2DYNAMIXEL_MAX_BYTE_VALUE) && (CY_PSOC3))
            UART2DYNAMIXEL_EnableTxInt();
        #endif /* (UART2DYNAMIXEL_TX_BUFFER_SIZE > UART2DYNAMIXEL_MAX_BYTE_VALUE) && (CY_PSOC3) */

            if(0u != (UART2DYNAMIXEL_TXSTATUS_REG & UART2DYNAMIXEL_TX_STS_FIFO_EMPTY))
            {
                /* Trigger TX interrupt to send software buffer */
                UART2DYNAMIXEL_SetPendingTxInt();
            }
        }

    #else

        while((UART2DYNAMIXEL_TXSTATUS_REG & UART2DYNAMIXEL_TX_STS_FIFO_FULL) != 0u)
        {
            /* Wait for room in the FIFO */
        }

