biobotus/module-gripper-psoc/module-gripper-psoc.cydsn/Generated_Source/PSoC5/UART2DYNAMIXEL.c
        /* Add directly to the FIFO */
        UART2DYNAMIXEL_TXDATA_REG = txDataByte;

    #endif /* UART2DYNAMIXEL_TX_INTERRUPT_ENABLED */
    }


    /*******************************************************************************
    * Function Name: UART2DYNAMIXEL_PutString
    ********************************************************************************
    *
    * Summary:
    *  Sends a NULL terminated string to the TX buffer for transmission.
    *
    * Parameters:
    *  string[]: Pointer to the null terminated string array residing in RAM or ROM
    *
    * Return:
    *  None.
    *
    * Global Variables:
    *  UART2DYNAMIXEL_initVar - checked to identify that the component has been
    *     initialized.
    *
    * Reentrant:
    *  No.
    *
    * Theory:
    *  If there is not enough memory in the TX buffer for the entire string, this
    *  function blocks until the last character of the string is loaded into the
    *  TX buffer.
    *
    *******************************************************************************/
    void UART2DYNAMIXEL_PutString(const char8 string[]) 
    {
        uint16 bufIndex = 0u;

        /* If not Initialized then skip this function */
        if(UART2DYNAMIXEL_initVar != 0u)
        {
            /* This is a blocking function, it will not exit until all data is sent */
            while(string[bufIndex] != (char8) 0)
            {
                UART2DYNAMIXEL_PutChar((uint8)string[bufIndex]);
                bufIndex++;
            }
        }
    }


    /*******************************************************************************
    * Function Name: UART2DYNAMIXEL_PutArray
    ********************************************************************************
    *
    * Summary:
    *  Places N bytes of data from a memory array into the TX buffer for
    *  transmission.
    *
    * Parameters:
    *  string[]: Address of the memory array residing in RAM or ROM.
    *  byteCount: Number of bytes to be transmitted. The type depends on TX Buffer
    *             Size parameter.
    *
    * Return:
    *  None.
    *
    * Global Variables:
    *  UART2DYNAMIXEL_initVar - checked to identify that the component has been
    *     initialized.
    *
    * Reentrant:
    *  No.
    *
    * Theory:
    *  If there is not enough memory in the TX buffer for the entire string, this
    *  function blocks until the last character of the string is loaded into the
    *  TX buffer.
    *
    *******************************************************************************/
    void UART2DYNAMIXEL_PutArray(const uint8 string[], uint8 byteCount)
                                                                    
    {
        uint8 bufIndex = 0u;

        /* If not Initialized then skip this function */
        if(UART2DYNAMIXEL_initVar != 0u)
        {
            while(bufIndex < byteCount)
            {
                UART2DYNAMIXEL_PutChar(string[bufIndex]);
                bufIndex++;
            }
        }
    }


    /*******************************************************************************
    * Function Name: UART2DYNAMIXEL_PutCRLF
    ********************************************************************************
    *
    * Summary:
    *  Writes a byte of data followed by a carriage return (0x0D) and line feed
    *  (0x0A) to the transmit buffer.
    *
    * Parameters:
    *  txDataByte: Data byte to transmit before the carriage return and line feed.
    *
    * Return:
    *  None.
    *
    * Global Variables:
    *  UART2DYNAMIXEL_initVar - checked to identify that the component has been
    *     initialized.
    *
    * Reentrant:
    *  No.
    *
    *******************************************************************************/
    void UART2DYNAMIXEL_PutCRLF(uint8 txDataByte) 
    {
        /* If not Initialized then skip this function */
        if(UART2DYNAMIXEL_initVar != 0u)
        {
            UART2DYNAMIXEL_PutChar(txDataByte);
            UART2DYNAMIXEL_PutChar(0x0Du);
            UART2DYNAMIXEL_PutChar(0x0Au);
        }
    }


    /*******************************************************************************
    * Function Name: UART2DYNAMIXEL_GetTxBufferSize
    ********************************************************************************
    *
    * Summary:
    *  Returns the number of bytes in the TX buffer which are waiting to be 
    *  transmitted.
    *  * TX software buffer is disabled (TX Buffer Size parameter is equal to 4): 
    *    returns 0 for empty TX FIFO, 1 for not full TX FIFO or 4 for full TX FIFO.
    *  * TX software buffer is enabled: returns the number of bytes in the TX 
    *    software buffer which are waiting to be transmitted. Bytes available in the
    *    TX FIFO do not count.
    *
    * Parameters:
    *  None.
    *
    * Return:
    *  Number of bytes used in the TX buffer. Return value type depends on the TX 
    *  Buffer Size parameter.
    *
    * Global Variables:
    *  UART2DYNAMIXEL_txBufferWrite - used to calculate left space.
    *  UART2DYNAMIXEL_txBufferRead - used to calculate left space.
    *
    * Reentrant:
    *  No.
    *
    * Theory:
    *  Allows the user to find out how full the TX Buffer is.
    *
    *******************************************************************************/
    uint8 UART2DYNAMIXEL_GetTxBufferSize(void)
                                                            
    {
        uint8 size;

    #if (UART2DYNAMIXEL_TX_INTERRUPT_ENABLED)

        /* Protect variables that could change on interrupt. */
        UART2DYNAMIXEL_DisableTxInt();

        if(UART2DYNAMIXEL_txBufferRead == UART2DYNAMIXEL_txBufferWrite)
        {
            size = 0u;
        }
        else if(UART2DYNAMIXEL_txBufferRead < UART2DYNAMIXEL_txBufferWrite)
        {
            size = (UART2DYNAMIXEL_txBufferWrite - UART2DYNAMIXEL_txBufferRead);
        }
        else
        {
            size = (UART2DYNAMIXEL_TX_BUFFER_SIZE - UART2DYNAMIXEL_txBufferRead) +
                    UART2DYNAMIXEL_txBufferWrite;
        }

        UART2DYNAMIXEL_EnableTxInt();

    #else

        size = UART2DYNAMIXEL_TXSTATUS_REG;

