biobotus/module-gripper-psoc/module-gripper-psoc.cydsn/Generated_Source/PSoC5/UART2DYNAMIXEL.c
        /* Is the fifo is full. */
        if((size & UART2DYNAMIXEL_TX_STS_FIFO_FULL) != 0u)
        {
            size = UART2DYNAMIXEL_FIFO_LENGTH;
        }
        else if((size & UART2DYNAMIXEL_TX_STS_FIFO_EMPTY) != 0u)
        {
            size = 0u;
        }
        else
        {
            /* We only know there is data in the fifo. */
            size = 1u;
        }

    #endif /* (UART2DYNAMIXEL_TX_INTERRUPT_ENABLED) */

    return(size);
    }


    /*******************************************************************************
    * Function Name: UART2DYNAMIXEL_ClearTxBuffer
    ********************************************************************************
    *
    * Summary:
    *  Clears all data from the TX buffer and hardware TX FIFO.
    *
    * Parameters:
    *  None.
    *
    * Return:
    *  None.
    *
    * Global Variables:
    *  UART2DYNAMIXEL_txBufferWrite - cleared to zero.
    *  UART2DYNAMIXEL_txBufferRead - cleared to zero.
    *
    * Reentrant:
    *  No.
    *
    * Theory:
    *  Setting the pointers to zero makes the system believe there is no data to
    *  read and writing will resume at address 0 overwriting any data that may have
    *  remained in the RAM.
    *
    * Side Effects:
    *  Data waiting in the transmit buffer is not sent; a byte that is currently
    *  transmitting finishes transmitting.
    *
    *******************************************************************************/
    void UART2DYNAMIXEL_ClearTxBuffer(void) 
    {
        uint8 enableInterrupts;

        enableInterrupts = CyEnterCriticalSection();
        /* Clear the HW FIFO */
        UART2DYNAMIXEL_TXDATA_AUX_CTL_REG |= (uint8)  UART2DYNAMIXEL_TX_FIFO_CLR;
        UART2DYNAMIXEL_TXDATA_AUX_CTL_REG &= (uint8) ~UART2DYNAMIXEL_TX_FIFO_CLR;
        CyExitCriticalSection(enableInterrupts);

    #if (UART2DYNAMIXEL_TX_INTERRUPT_ENABLED)

        /* Protect variables that could change on interrupt. */
        UART2DYNAMIXEL_DisableTxInt();

        UART2DYNAMIXEL_txBufferRead = 0u;
        UART2DYNAMIXEL_txBufferWrite = 0u;

        /* Enable Tx interrupt. */
        UART2DYNAMIXEL_EnableTxInt();

    #endif /* (UART2DYNAMIXEL_TX_INTERRUPT_ENABLED) */
    }


    /*******************************************************************************
    * Function Name: UART2DYNAMIXEL_SendBreak
    ********************************************************************************
    *
    * Summary:
    *  Transmits a break signal on the bus.
    *
    * Parameters:
    *  uint8 retMode:  Send Break return mode. See the following table for options.
    *   UART2DYNAMIXEL_SEND_BREAK - Initialize registers for break, send the Break
    *       signal and return immediately.
    *   UART2DYNAMIXEL_WAIT_FOR_COMPLETE_REINIT - Wait until break transmission is
    *       complete, reinitialize registers to normal transmission mode then return
    *   UART2DYNAMIXEL_REINIT - Reinitialize registers to normal transmission mode
    *       then return.
    *   UART2DYNAMIXEL_SEND_WAIT_REINIT - Performs both options: 
    *      UART2DYNAMIXEL_SEND_BREAK and UART2DYNAMIXEL_WAIT_FOR_COMPLETE_REINIT.
    *      This option is recommended for most cases.
    *
    * Return:
    *  None.
    *
    * Global Variables:
    *  UART2DYNAMIXEL_initVar - checked to identify that the component has been
    *     initialized.
    *  txPeriod - static variable, used for keeping TX period configuration.
    *
    * Reentrant:
    *  No.
    *
    * Theory:
    *  SendBreak function initializes registers to send 13-bit break signal. It is
    *  important to return the registers configuration to normal for continue 8-bit
    *  operation.
    *  There are 3 variants for this API usage:
    *  1) SendBreak(3) - function will send the Break signal and take care on the
    *     configuration returning. Function will block CPU until transmission
    *     complete.
    *  2) User may want to use blocking time if UART configured to the low speed
    *     operation
    *     Example for this case:
    *     SendBreak(0);     - initialize Break signal transmission
    *         Add your code here to use CPU time
    *     SendBreak(1);     - complete Break operation
    *  3) Same to 2) but user may want to initialize and use the interrupt to
    *     complete break operation.
    *     Example for this case:
    *     Initialize TX interrupt with "TX - On TX Complete" parameter
    *     SendBreak(0);     - initialize Break signal transmission
    *         Add your code here to use CPU time
    *     When interrupt appear with UART2DYNAMIXEL_TX_STS_COMPLETE status:
    *     SendBreak(2);     - complete Break operation
    *
    * Side Effects:
    *  The UART2DYNAMIXEL_SendBreak() function initializes registers to send a
    *  break signal.
    *  Break signal length depends on the break signal bits configuration.
    *  The register configuration should be reinitialized before normal 8-bit
    *  communication can continue.
    *
    *******************************************************************************/
    void UART2DYNAMIXEL_SendBreak(uint8 retMode) 
    {

        /* If not Initialized then skip this function*/
        if(UART2DYNAMIXEL_initVar != 0u)
        {
            /* Set the Counter to 13-bits and transmit a 00 byte */
            /* When that is done then reset the counter value back */
            uint8 tmpStat;

        #if(UART2DYNAMIXEL_HD_ENABLED) /* Half Duplex mode*/

            if( (retMode == UART2DYNAMIXEL_SEND_BREAK) ||
                (retMode == UART2DYNAMIXEL_SEND_WAIT_REINIT ) )
            {
                /* CTRL_HD_SEND_BREAK - sends break bits in HD mode */
                UART2DYNAMIXEL_WriteControlRegister(UART2DYNAMIXEL_ReadControlRegister() |
                                                      UART2DYNAMIXEL_CTRL_HD_SEND_BREAK);
                /* Send zeros */
                UART2DYNAMIXEL_TXDATA_REG = 0u;

                do /* Wait until transmit starts */
                {
                    tmpStat = UART2DYNAMIXEL_TXSTATUS_REG;
                }
                while((tmpStat & UART2DYNAMIXEL_TX_STS_FIFO_EMPTY) != 0u);
            }

            if( (retMode == UART2DYNAMIXEL_WAIT_FOR_COMPLETE_REINIT) ||
                (retMode == UART2DYNAMIXEL_SEND_WAIT_REINIT) )
            {
                do /* Wait until transmit complete */
                {
                    tmpStat = UART2DYNAMIXEL_TXSTATUS_REG;
                }
                while(((uint8)~tmpStat & UART2DYNAMIXEL_TX_STS_COMPLETE) != 0u);
            }

            if( (retMode == UART2DYNAMIXEL_WAIT_FOR_COMPLETE_REINIT) ||
                (retMode == UART2DYNAMIXEL_REINIT) ||
                (retMode == UART2DYNAMIXEL_SEND_WAIT_REINIT) )
            {
                UART2DYNAMIXEL_WriteControlRegister(UART2DYNAMIXEL_ReadControlRegister() &
                                              (uint8)~UART2DYNAMIXEL_CTRL_HD_SEND_BREAK);
            }

        #else /* UART2DYNAMIXEL_HD_ENABLED Full Duplex mode */

            static uint8 txPeriod;

            if( (retMode == UART2DYNAMIXEL_SEND_BREAK) ||
                (retMode == UART2DYNAMIXEL_SEND_WAIT_REINIT) )
            {
                /* CTRL_HD_SEND_BREAK - skip to send parity bit at Break signal in Full Duplex mode */
                #if( (UART2DYNAMIXEL_PARITY_TYPE != UART2DYNAMIXEL__B_UART__NONE_REVB) || \
                                    (UART2DYNAMIXEL_PARITY_TYPE_SW != 0u) )
                    UART2DYNAMIXEL_WriteControlRegister(UART2DYNAMIXEL_ReadControlRegister() |
                                                          UART2DYNAMIXEL_CTRL_HD_SEND_BREAK);
                #endif /* End UART2DYNAMIXEL_PARITY_TYPE != UART2DYNAMIXEL__B_UART__NONE_REVB  */

                #if(UART2DYNAMIXEL_TXCLKGEN_DP)
                    txPeriod = UART2DYNAMIXEL_TXBITCLKTX_COMPLETE_REG;
                    UART2DYNAMIXEL_TXBITCLKTX_COMPLETE_REG = UART2DYNAMIXEL_TXBITCTR_BREAKBITS;
                #else
                    txPeriod = UART2DYNAMIXEL_TXBITCTR_PERIOD_REG;
                    UART2DYNAMIXEL_TXBITCTR_PERIOD_REG = UART2DYNAMIXEL_TXBITCTR_BREAKBITS8X;
                #endif /* End UART2DYNAMIXEL_TXCLKGEN_DP */

                /* Send zeros */
                UART2DYNAMIXEL_TXDATA_REG = 0u;

                do /* Wait until transmit starts */
                {
                    tmpStat = UART2DYNAMIXEL_TXSTATUS_REG;
                }
                while((tmpStat & UART2DYNAMIXEL_TX_STS_FIFO_EMPTY) != 0u);
            }

            if( (retMode == UART2DYNAMIXEL_WAIT_FOR_COMPLETE_REINIT) ||
                (retMode == UART2DYNAMIXEL_SEND_WAIT_REINIT) )
            {
                do /* Wait until transmit complete */
                {
                    tmpStat = UART2DYNAMIXEL_TXSTATUS_REG;
                }
                while(((uint8)~tmpStat & UART2DYNAMIXEL_TX_STS_COMPLETE) != 0u);
            }

            if( (retMode == UART2DYNAMIXEL_WAIT_FOR_COMPLETE_REINIT) ||
                (retMode == UART2DYNAMIXEL_REINIT) ||
                (retMode == UART2DYNAMIXEL_SEND_WAIT_REINIT) )
            {

            #if(UART2DYNAMIXEL_TXCLKGEN_DP)
                UART2DYNAMIXEL_TXBITCLKTX_COMPLETE_REG = txPeriod;
            #else
                UART2DYNAMIXEL_TXBITCTR_PERIOD_REG = txPeriod;
            #endif /* End UART2DYNAMIXEL_TXCLKGEN_DP */

