biobotus/module-gripper-psoc/module-gripper-psoc.cydsn/Generated_Source/PSoC5/UART2DYNAMIXEL.c
            #if( (UART2DYNAMIXEL_PARITY_TYPE != UART2DYNAMIXEL__B_UART__NONE_REVB) || \
                 (UART2DYNAMIXEL_PARITY_TYPE_SW != 0u) )
                UART2DYNAMIXEL_WriteControlRegister(UART2DYNAMIXEL_ReadControlRegister() &
                                                      (uint8) ~UART2DYNAMIXEL_CTRL_HD_SEND_BREAK);
            #endif /* End UART2DYNAMIXEL_PARITY_TYPE != NONE */
            }
        #endif    /* End UART2DYNAMIXEL_HD_ENABLED */
        }
    }


    /*******************************************************************************
    * Function Name: UART2DYNAMIXEL_SetTxAddressMode
    ********************************************************************************
    *
    * Summary:
    *  Configures the transmitter to signal the next bytes is address or data.
    *
    * Parameters:
    *  addressMode: 
    *       UART2DYNAMIXEL_SET_SPACE - Configure the transmitter to send the next
    *                                    byte as a data.
    *       UART2DYNAMIXEL_SET_MARK  - Configure the transmitter to send the next
    *                                    byte as an address.
    *
    * Return:
    *  None.
    *
    * Side Effects:
    *  This function sets and clears UART2DYNAMIXEL_CTRL_MARK bit in the Control
    *  register.
    *
    *******************************************************************************/
    void UART2DYNAMIXEL_SetTxAddressMode(uint8 addressMode) 
    {
        /* Mark/Space sending enable */
        if(addressMode != 0u)
        {
        #if( UART2DYNAMIXEL_CONTROL_REG_REMOVED == 0u )
            UART2DYNAMIXEL_WriteControlRegister(UART2DYNAMIXEL_ReadControlRegister() |
                                                  UART2DYNAMIXEL_CTRL_MARK);
        #endif /* End UART2DYNAMIXEL_CONTROL_REG_REMOVED == 0u */
        }
        else
        {
        #if( UART2DYNAMIXEL_CONTROL_REG_REMOVED == 0u )
            UART2DYNAMIXEL_WriteControlRegister(UART2DYNAMIXEL_ReadControlRegister() &
                                                  (uint8) ~UART2DYNAMIXEL_CTRL_MARK);
        #endif /* End UART2DYNAMIXEL_CONTROL_REG_REMOVED == 0u */
        }
    }

#endif  /* EndUART2DYNAMIXEL_TX_ENABLED */

#if(UART2DYNAMIXEL_HD_ENABLED)


    /*******************************************************************************
    * Function Name: UART2DYNAMIXEL_LoadRxConfig
    ********************************************************************************
    *
    * Summary:
    *  Loads the receiver configuration in half duplex mode. After calling this
    *  function, the UART is ready to receive data.
    *
    * Parameters:
    *  None.
    *
    * Return:
    *  None.
    *
    * Side Effects:
    *  Valid only in half duplex mode. You must make sure that the previous
    *  transaction is complete and it is safe to unload the transmitter
    *  configuration.
    *
    *******************************************************************************/
    void UART2DYNAMIXEL_LoadRxConfig(void) 
    {
        UART2DYNAMIXEL_WriteControlRegister(UART2DYNAMIXEL_ReadControlRegister() &
                                                (uint8)~UART2DYNAMIXEL_CTRL_HD_SEND);
        UART2DYNAMIXEL_RXBITCTR_PERIOD_REG = UART2DYNAMIXEL_HD_RXBITCTR_INIT;

    #if (UART2DYNAMIXEL_RX_INTERRUPT_ENABLED)
        /* Enable RX interrupt after set RX configuration */
        UART2DYNAMIXEL_SetRxInterruptMode(UART2DYNAMIXEL_INIT_RX_INTERRUPTS_MASK);
    #endif /* (UART2DYNAMIXEL_RX_INTERRUPT_ENABLED) */
    }


    /*******************************************************************************
    * Function Name: UART2DYNAMIXEL_LoadTxConfig
    ********************************************************************************
    *
    * Summary:
    *  Loads the transmitter configuration in half duplex mode. After calling this
    *  function, the UART is ready to transmit data.
    *
    * Parameters:
    *  None.
    *
    * Return:
    *  None.
    *
    * Side Effects:
    *  Valid only in half duplex mode. You must make sure that the previous
    *  transaction is complete and it is safe to unload the receiver configuration.
    *
    *******************************************************************************/
    void UART2DYNAMIXEL_LoadTxConfig(void) 
    {
    #if (UART2DYNAMIXEL_RX_INTERRUPT_ENABLED)
        /* Disable RX interrupts before set TX configuration */
        UART2DYNAMIXEL_SetRxInterruptMode(0u);
    #endif /* (UART2DYNAMIXEL_RX_INTERRUPT_ENABLED) */

        UART2DYNAMIXEL_WriteControlRegister(UART2DYNAMIXEL_ReadControlRegister() | UART2DYNAMIXEL_CTRL_HD_SEND);
        UART2DYNAMIXEL_RXBITCTR_PERIOD_REG = UART2DYNAMIXEL_HD_TXBITCTR_INIT;
    }

#endif  /* UART2DYNAMIXEL_HD_ENABLED */


/* [] END OF FILE */
